import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:online_course/screens/books/states.dart';

import 'model.dart';

class BooksCubit extends Cubit<BooksStates> {
  BooksCubit() : super(BooksStates());

  void getBooks() async {
    emit(BooksLoadingState());
    await Future.delayed(const Duration(seconds: 3));
    List<Book> list = [
      Book(
          id: 0,
          title: "فاتتنى صلاة ",
          description:
              'كتاب " فاتتني صلاة " من تأليف الكاتب " اسلام جمال " كتاب موجه خاصة لمن لا يصلون و يتهاونون على الصلاة في هذا الكتاب سوف تجد أحسن الطرق للمواظبة عليها لأننا نعلم بأن الصلاة هي السبيل للسعادة و الطمأنينة.. نبذة عن الكتاب : في الصغر إعتدنا أن يأمرنا من يكبرنا بالصلاة .. فنمتثل للأمر ثم نذهب لنصلي فنجد أن الصلاة ثقيلة .. فنتركها !! نسمع شيخاً يتحدث عن الصلاة و أهميتها و عقوبة وعقوبة تاركها فنذهب لنصلي فنجد ان الصلاة ثقيلة فنتركها ظننا ان من يأمرنا بها لايشعر بما نشعر به ظننا ان من يحافظ عليها لديه هبة إلهية ليست عندنا انتظرنا تلك الهبة طويلاً ،حتي فاتتنا صلاة بعد الصلاة لاننا لم نحل اصل المشكلة وهو لماذا تبدو الصلاة ثقيلة. ملخص فاتتني صلاة يتسائل اسلام جمال لماذا البعض يحافظ على الصلاة بينما يتركها الكثيرين ؟ فقسم لنا الكاتب الكتاب إلى عدة فصول للتعرف على أسرار هؤلاء الذين قلما فاتتهم صلاة . " فاتتني صلاة " في هذا الفصل يتكلم الكاتب حول ذلك الشيخ العجوز الذي قاري عمره 80 يتكأ على عصاه في طريقه للمسجد بينما هو يضع أعذار لنفسه بأنه لا يملك الوقت أو أنه مشغول و يقنع نفسه بعدة أشياء حتى فاتته صلاة .. فتسائل على السر للمحافظة عن الصلاة فقرر أن يسأل الذين نادرا ما فاتتهم الصلاة قصد التعرف على أسرارهم ، كما أنه لاحظ بأن سير و عادات الناجحين في حياتهم و عادات الناجحين في المحافظة على الصلاة تشابه كبير... " يوما ما ! " الكل يعلم بأن السعادة و السكينه تتشكل بالصلاة ، مع ذلك الكثير لم يصلي ..بحث الكاتب عن الأسباب ووجد أهمها هي أن حال الغير مصلين يعيشون في عالم صنعوه بأنفسهم يسمى يوما ما ..الكل يعتقد بأن حالنا سوف يتغير في يوما ما و نصبح من المصلين و وضع عدة اعذار لا فائدة لها ،و هذا إتجاه خاطئ ..من الأفضل أن نخرج من هذا الطريق و نتجه نحوى عوامل تعيننا على الصلاة .. " قبل أن تصلي " في هذا الفصل يقدم لنا الكاتب عدة مهارات و أسرار جمعها من خلال محادثته مع الذين قلما فاتتهم صلاة ..أخبرنا بأن أول مهارة التي يجب أن ندركها حقا للحفاظ على الصلاة و هي أن تتعرف على الله عز و جل لأنك إذا عرفت الله حقا احسنت الظن به و ملئت السكينة قلبك ..لذلك من الاحسن ان نسمع أحدا يحدثنا عن الله عز و جل ...قدم لنا الكاتب لمساعدتنا على هذه العادة عدة مواعظ و قصص الأنبياء و بعض الدعاة المفضلين لديه ..كلما حافظت على أعمال بسيطة التي لا تحتاج إلى مجهود كبير كلما قويت روحك و أعانتك على وسوسة الشيطان ... " أنت أفكارك " يقصد الكاتب بأنت أفكارك هي أن الحوار الذي يدور داخل عقلك هو من يسير حياتك ، و الأشياء التي تفعلها كل يوم هي تنفيد للأفكار المسيطرة على عقلك ، لذلك يجب ان تحسن من أفكارك و لاتستهين بها و احمي عقلك من الأفكار السلبية و استبدلها بأفكار ايجابية لكي تتحسن حياتك ..ما دام العقل يعمل بهذه الطريقة إذا لنستغله باستخدامه في طريقة لتعيننا على الصلاة بدلا من ان نستخدمه في الطريقة لنتصارع ضد الصلاة و نختلق الأعذار لنتركها ... " الصفة المعجزة " في هذا الفصل يتحدث الكاتب عن الصفة المعجزة و هي التي يشترك فيها جميع المصلين ، هم لا يملكون قدرات خاصة أو ظروف إستثنائية ، لكنهم طورو هذه الصفة المعجزة حتى أصبحت عادة .يأكد لنا الكاتب بأن هذه الصفة هي أساس كل نجاح و بدون هذه الصفة تصبح أي معلومة عديمة الفائدة...في هذا الفصل قدم لنا العديد من المعلومات بخصوص تلك الصفة من بينها : - ضبط النفس : و يقصد به أن تقوم بما عليك فعله من في الوقت المحدد له سواء أحببت هذا العمل أم لم تحبه ... - لا تشاور عقلك : لأن المشاورة العقلية تستهلك طاقة كبيرة و هي سبب كبير للتكاسل... - النقطة المرجعية : يقصد بها الكاتب هي حدث نجحت أنت في القيام به سلفا تحت ظرف صعب ، فهذا الحدث يكون دافع محفز لك... - هذا الوقت سيمضي : تذكر دائما بأن كل الأعمال الشاقة و المتعبة ستمضي ... " ألك حاجة !؟ " بعدة مفاهيم و معلومات أقنعنا الكاتب بأن الحكمة من المصائب و تحديات الحياة اليومية هي من تجعلك على صلة حقيقية بالله ، و ستشعر بمعنى العزة الحقيقي عندما تجد حاجتك تساق إليك و تتعرف على معنى الإيمان الحقيقي ...فالصلاة هي وسيلة لإصلاح الأمور و تحقيق حاجات و كذلك جلب الطمأنينة إلى القلب ... " كن صباحا " أخبرنا الكاتب في هذا الفصل الطويل عن قصة" هال إيلرود" في كتابه "الصباح المعجزة "الذي غير حياة آلاف الأشخاص ..و كيف أن الإستيقاظ مبكرا أنقذه من حالة إكتئاب..و كاتبنا بدوره روى لنا قصته و سماها بالصلاة المعجزة لأن ديننا الحنيف يفرض علينا ذلك و ذلك بصلاة الفجر ...صلاة الفجر معجزة قادرة على تحقيق أهدافك لو خصصت لها وقتها سوف تتغير حياتك نحوى الأفضل و ستكسبك منظورا جديدا يساعدك على الإرتقاء في كل جوانب حياتك .... " بيت هناك " يقول الكاتب مستندا على حديث الرسول صلى الله عليه و سلم " من صلى اثنتي عشر ركعة غير الفريضة في يوم و ليلة يبني له بهن بيت في الجنة " حتى ولو قمنا بصلاتها ليوم واحد فقط سيبنى لنا بيت و يصبح ضماننا في الجنة ، والله سبحانه و تعالى لن يضيع عبدا له بيت في الجنة لأنه خير العادلين ..لأن بسنن الرواتب تبني بيتا في الجنة ..كذلك كلما تحصنت بصلاة النوافل كلما ضعف عدواك و كلما أحبك الله منحك الرضا ... " و ترتيبها " قدم لنا المؤلف أهم أسباب لعدم حفاظ على الصلاة هو سوء التخطيط لها ، لأن معظم مشاكلنا تبدأ لما لا ندري ما هية الطريقة المثلى التي يجب أن يسير عليها يومنا و لا ندري ما هية الأمور المهمة التي يجب ان نعطيها اهتماماتنا و ما هية الأمور الأقل أهمية و نترك أنفسنا للظروف ...لذلك يجب ان ترتب يومك و أعمالك واجعلها تدور حول الصلاة بدلا من أن تدور الصلاة حول أعمالك فتضيع . " حماقات ارتكبتها " يقول الكاتب بأن جميعنا نملك ماضي مليء بالتعثرات منها التي باعدت بيننا و بين الصلاة و في هذه اللحظة يمكنه ان يكون في صالحنا و ذلك لأن الماضي هو أغنى مصادر الخبرات التي يمكن أن نعتمد عليها لنحيا حياة أحسن ..لذلك لا تكرر الخطأ مرتين و في كل مرة تخسرها امام شيطانك و تفوت صلاتك حلل جيدا هذه الجولة لتتعرف على سبب هذه الهزيمة و لا تكرر الخطأ ... " لا طاقة لك " في هذا الفصل يقدم لنا الكاتب أهم الحلول المعالجة لحالة التعب و النعاس و الكسل. " واصطبر عليها " يقصد بها المثابرة و التدريب اليومي لأن ثمار الصلاة لا تحصد بين ليلة و ضحاها بل ستجد ثمارها في كل عقبة تواجهها و في كل محنة ..لذلك فالصلاة هي دورة تدربية للنفس تستغرق عمرك بأكمله لكي تستقيم حياتك ... " هكذا عرفته " كل من يقترب من الله عز وجل يعيش حياة بلا قلق و لا حزن يكفي ان تطيع أمره و هو يكفيك كل شيء لأن الله أكبر من كل شيء ، صحيح ان الدنيا فيها هلع و جزع و هم و حزن و خوف لكن إذا كنت من المصلين المحافظين على الصلاة كما أرادها الله فانت مستثني من هذا كله ، و ان جارت عليك الدنيا اشتكي عليها لخالقها و مالكها ...فلتكن الدنيا كما تكون و لنكن نحن مع وعد الله الودود لنا نستغفره فيتوب علينا و ينعم علينا بالخيرات .',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/2/6/b/8/628dd2af4d6b8931be3c95aedc4e5ed9.png.webp"),
      Book(
          id: 1,
          title: "القرآن تدبر وعمل ",
          description: ''' 
     إقبال المسلمين على كتاب ربهم سماعًا وتلاوة وحفظً مشهودًا وظاهرًا إلا أن هذا الإقبال ظل محصورًا في رتب الاستماع والتلاوة والحفظ دون التدبر والعمل. لأجل ذلك نشأت فكرة إعداد منهج يعين على تيسير تدبر القرآن الكريم والعمل به، ويخاطب مختلف الراغبين والحريصين، فكان هذا المنهج الذي وضعه مركز المنهاج للإشراف والتدريب التربوي بالرياض بين يديك أخي القارئ الكريم؛ سائلين الله تعالى أن إقبال المسلمين على كتاب ربهم سماعًا وتلاوة وحفظً مشهودًا وظاهرًا إلا أن هذا الإقبال ظل محصورًا في رتب الاستماع والتلاوة والحفظ دون التدبر والعمل. لأجل ذلك نشأت فكرة إعداد منهج يعين على تيسير تدبر القرآن الكريم والعمل به، ويخاطب مختلف الراغبين والحريصين، فكان هذا المنهج الذي وضعه مركز المنهاج للإشراف والتدريب التربوي بالرياض بين يديك أخي القارئ الكريم؛ سائلين الله تعالى أن ينفع به الأمة وينهض بها. -
      ''',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/3/3/5/8/a80fa8d4f035827b0b10495484c1c0c7.jpg.webp"),
    ];
    // emit(BooksFailedState(message: "Failed"));
    emit(BooksSuccessState(list: list));
  }

  void toggleFav({required int id}) async
  {
    emit(ToggleFavLoadingState());
    await Future.delayed(const Duration(seconds: 2));
    emit(ToggleFavSuccessState(id:id));
  }

}
